{
  "personal_info": {
    "name": "Songhai (Frank) Fan",
    "first_name": "Songhai",
    "first_name_pronounce": "/ˈsɒŋˌhaɪ/",
    "last_name": "Fan",
    "last_name_pronounce": "/fæn/",
    "nickname": "Frank",
    "location": "Melbourne, Australia",
    "phone": "+61 0434 780 632",
    "email": "songhai.fan2025@gmail.com",
    "links": {
      "github": "https://github.com/SonghaiFan",
      "website": "https://songhai.one",
      "linkedin": "https://www.linkedin.com/in/songhaifan"
    },
    "summary": "PhD Researcher in Human-Centered Computing passionate about leveraging LLMs and AI for enhanced human-data interaction. Expertise in narrative visualization, immersive analytics, and data storytelling, with a focus on developing AI-augmented frameworks that bridge human understanding with complex data systems. Skilled in Python, React, D3.js, and advanced NLP techniques, combining technical proficiency with a deep interest in human-AI collaborative systems."
  },

  "education": [
    {
      "degree": "PhD in Human-Centered Computing",
      "institution": "Monash University, Australia",
      "period": "Oct 2021 – Jul 2025 Expected",
      "research": "Research: Narrative Visualization and Analytics",
      "highlights": [
        "Narrative visualization frameworks, LLM text visualization, and human-centered data interfaces"
      ]
    },
    {
      "degree": "Master of Data Science (Awarded with Distinction)",
      "institution": "Monash University, Australia",
      "period": "June 2019 – June 2021",
      "highlights": [
        "Key courses: Business Intelligence Modelling, Data Exploration & Visualisation, Statistical Data Modelling, Big Data Processing, Data Wrangling, Applied Data Analysis, Data Warehousing"
      ]
    },
    {
      "degree": "Bachelor of Engineering (Honors)",
      "institution": "Monash University, Australia / Central South University, China",
      "period": "March 2014 – Dec 2018"
    }
  ],

  "work_experience": [
    {
      "title": "Teaching Associate & Tutor",
      "company": "Monash University",
      "location": "Melbourne, Australia",
      "period": "Oct 2021 – Present",
      "type": "Part-time",
      "responsibilities": [
        "Tutored undergraduate and graduate students in data science, visualization, and human-computer interaction courses",
        "Designed and delivered interactive workshops on D3.js, Python data analysis, and research methodologies",
        "Mentored 200+ students in capstone projects involving data visualization and UX"
      ],
      "achievements": [
        "Received consistently high student evaluation scores (4.8/5.0 average)",
        "Developed innovative teaching materials for interactive data visualization techniques"
      ]
    }
  ],

  "phd_research": {
    "sections": [
      {
        "title": "Narrative Visualization | NLP | Human-Centered AI",
        "items": [
          {
            "point": "Developed the Time-Track Narrative Graph (TTNG) to visualize complex narrative transitions over time and theme dimensions."
          },
          {
            "point": "Built a Graph-to-Text pipeline using LLMs (e.g., GPT) to generate synthetic news datasets for evaluating narrative comprehension."
          },
          {
            "point": "Conducted user studies aligning algorithmic outputs with human understanding across cognitive tasks."
          },
          {
            "point": "Applied advanced NLP techniques: topic modeling, sentiment analysis, and text summarization to structure and analyze news narratives."
          },
          {
            "point": "Explored scrollytelling and immersive analytics to improve user engagement and comprehension in interactive storytelling."
          }
        ]
      }
    ]
  },
  "skills_pool": {
    "data_analysis": {
      "name": "Data Analysis & Storytelling",
      "category": "data_science",
      "level": 5,
      "tech_stack": [
        "Python (pandas, NumPy)",
        "R (tidyverse)",
        "SQL",
        "Tableau",
        "Power BI"
      ],
      "core_skill": [
        "Data Cleaning & Wrangling",
        "EDA",
        "Data Storytelling",
        "Business Intelligence"
      ],
      "methodology": [
        "Statistical Modelling (Regression, ANOVA)",
        "Time-Series Decomposition"
      ],
      "use_scenario": [
        "User Behavior Analysis",
        "Business Strategy Optimization"
      ]
    },
    "data_science_ai": {
      "name": "Data Science & AI",
      "category": "artificial_intelligence",
      "level": 3,
      "tech_stack": [
        "scikit-learn",
        "PyTorch",
        "TensorFlow",
        "NLTK",
        "HuggingFace",
        "OpenAI API"
      ],
      "core_skill": [
        "Feature Engineering",
        "Model Development & Evaluation",
        "Prompt Engineering"
      ],
      "methodology": [
        "Regression & Classification",
        "Topic Modeling",
        "Fine-Tuning"
      ],
      "use_scenario": [
        "Forecasting",
        "Recommendation Systems",
        "Text Classification",
        "Intelligent Q&A"
      ]
    },
    "research_evaluation": {
      "name": "Research & Evaluation",
      "category": "research",
      "level": 4,
      "core_skill": [
        "Problem Framing",
        "Hypothesis Generation",
        "Insight Synthesis",
        "Prototyping & Iteration"
      ],
      "methodology": [
        "Mixed Methods (Quant + Qual)",
        "Controlled Experiments",
        "Statistical Testing (t-test, ANOVA)"
      ],
      "use_scenario": [
        "User Behavior Investigation",
        "AI Product Evaluation",
        "Design Pattern Derivation",
        "Insight-to-Strategy Translation"
      ]
    },
    "big_data_engineering": {
      "name": "Big Data & Data Engineering",
      "category": "data_engineering",
      "level": 3,
      "tech_stack": ["Hadoop", "Spark", "Kafka", "SQL", "Firebase"],
      "core_skill": [
        "ETL Pipeline",
        "Data Warehousing",
        "Real-time Data Processing"
      ],
      "methodology": [
        "Batch vs Streaming Architecture",
        "Schema Design",
        "Data Quality Validation"
      ],
      "use_scenario": ["Large-scale Log Processing", "Data Lake Construction"]
    },
    "web_development_ux": {
      "name": "Web Development & UX",
      "category": "user_experience",
      "level": 5,
      "tech_stack": [
        "JavaScript",
        "React",
        "TailwindCSS",
        "D3.js",
        "Next.js",
        "Google Analytics"
      ],
      "core_skill": [
        "Interactive UI",
        "Frontend Data Viz",
        "A/B Testing",
        "UX Flow Design"
      ],
      "use_scenario": [
        "User Behavior Tracking",
        "Dynamic Dashboard Development",
        "Interactive Data Visualization"
      ]
    }
  },

  "projects": [
    {
      "id": "causal-network-viz",
      "title": "Causal Relationship Network Visualization",
      "description": "Built an interactive web app to visualize sentence-level causal networks using NLP and network analysis.",
      "features": [
        "Implemented topic clustering, centrality analysis, filtering, and search functionality."
      ],
      "tech_stack": "D3.js, React, Python, NetworkX, NLP APIs",
      "year": "2023"
    },
    {
      "id": "perspectiva-tool",
      "title": "Perspectiva – Participatory Causal Loop Diagram Tool",
      "description": "Designed a system to document and visualize stakeholder-driven causal models for urban governance.",
      "features": [
        "Enhanced transparency in data-driven policy-making through participatory modeling."
      ],
      "tech_stack": "React, D3.js, Node.js, Firebase",
      "year": "2022"
    },
    {
      "id": "data-storytelling-cases",
      "title": "Data Storytelling Case Studies",
      "description": "Collaborative data visualization projects with research organizations focusing on narrative-driven insights.",
      "features": [],
      "tech_stack": "D3.js, Python, Scrollytelling frameworks",
      "year": "2021-2023",
      "items": [
        {
          "title": "Disadvantage in the Media",
          "details": [
            "With the Paul Ramsay Foundation, analyzed 200+ news articles to uncover media framing of disadvantaged communities.",
            "Visualized multivariate coded data through scrollytelling, using waffle charts, force-directed graphs, and Alluvial plots."
          ]
        },
        {
          "title": "Climate Change Awareness",
          "details": [
            "With the Monash Climate Change Communication Research Hub (MCCCRH), created a climate visualization platform.",
            "Developed a location-aware, interactive scrolling narrative with custom threshold controls and historical comparisons."
          ]
        }
      ]
    }
  ],

  "publications": [
    {
      "title": "A Directed Graph Model and Experimental Framework for Design and Study of News Narrative Visualisation",
      "authors": "S Fan, T Dwyer, S Goodwin, H Purchase",
      "venue": "IEEE VIS",
      "year": "2025",
      "type": "Full Paper (under review)"
    },
    {
      "title": "ACCESS: A Benchmark for Abstract Causal Event Discovery and Reasoning",
      "authors": "G Haffari, V Vo, L Qu, T Feng, Y Hua, X Kang, S Fan, T Dwyer, L Soon",
      "venue": "NAACL",
      "year": "2025",
      "type": "Paper"
    },
    {
      "title": "Discourse lines: visualising current policy and media storylines of opportunity and disadvantage with narrative exploration maps",
      "authors": "S Angus, S Borgohain, S Fan, S Goodwin, A Kristanto, L O'Neill",
      "venue": "NLVIZ",
      "year": "2024",
      "type": "Workshop Paper"
    },
    {
      "title": "Understanding the Narrative: An Exploration of Narrative Structure and Visualisation Techniques in News Media",
      "authors": "S Fan, Y Ying, S Goodwin, S Angus, H Purchase, T Dwyer",
      "venue": "IEEE VIS",
      "year": "2023",
      "type": "Poster"
    }
  ],

  "certifications": [
    "Data Storytelling for Business – Tableau (2023)",
    "Power BI Data Analyst Associate – Microsoft (2023)",
    "Machine Learning Specialist – Scikit-learn & PyTorch (2022)",
    "Advanced JavaScript – CodeAcademy (2021)",
    "UX Methods – Google UX Design Certificate (2022)"
  ],

  "languages": [
    {
      "language": "Chinese",
      "proficiency": "Native"
    },
    {
      "language": "English",
      "proficiency": "Fluent"
    }
  ],

  "interests": [
    "Music: Guitarist in a local band, participant in Melbourne Chinese Music Festival",
    "Mentorship: Guiding students in data science and analytics projects"
  ],

  "cover_letters": {
    "data-scientist": {
      "recipient": {
        "company": "[Company Name]",
        "position": "[Position Title]",
        "department": "[Department/Team]"
      },
      "opening": "Dear Hiring Manager,",
      "body": [
        "I am writing to express my strong interest in the Data Scientist position at [Company Name]. As a PhD researcher in Human-Centered Computing with extensive experience in data analysis, statistical modeling, and visualization, I am excited about the opportunity to contribute to your data-driven initiatives.",
        "My research background has equipped me with deep expertise in Python, R, SQL, and advanced analytics tools like Tableau and Power BI. Through my work on narrative visualization frameworks and LLM text analysis, I have developed a unique ability to translate complex data insights into compelling stories that drive business decisions. My experience includes building interactive dashboards, conducting A/B testing, and developing predictive models for user behavior analysis.",
        "What particularly attracts me to this role is the opportunity to apply my technical skills in a business context while continuing to bridge the gap between human understanding and data complexity. I am passionate about creating data solutions that are not only technically sound but also accessible and actionable for stakeholders across all levels of an organization.",
        "I would welcome the opportunity to discuss how my background in data science research and practical experience with analytics tools can contribute to [Company Name]'s success. Thank you for considering my application."
      ],
      "closing": "Sincerely,",
      "signature": "Songhai (Frank) Fan"
    },
    "nlp-ai-engineer": {
      "recipient": {
        "company": "[Company Name]",
        "position": "[Position Title]",
        "department": "[AI/Engineering Team]"
      },
      "opening": "Dear Hiring Manager,",
      "body": [
        "I am excited to apply for the NLP/AI Engineer position at [Company Name]. With my PhD research focused on leveraging LLMs and AI for enhanced human-data interaction, combined with hands-on experience in PyTorch, TensorFlow, and HuggingFace, I am well-positioned to contribute to your AI initiatives.",
        "My research has involved developing Graph-to-Text pipelines using GPT models, implementing advanced NLP techniques including topic modeling and sentiment analysis, and creating AI-augmented frameworks for narrative comprehension. I have practical experience with prompt engineering, model fine-tuning, and building intelligent Q&A systems that bridge human understanding with complex language models.",
        "What excites me most about this opportunity is the chance to apply cutting-edge NLP research in a production environment. My background in human-centered AI ensures that I not only focus on technical performance but also on creating AI systems that are interpretable, reliable, and aligned with human needs and expectations.",
        "I am eager to discuss how my expertise in NLP, machine learning, and human-AI interaction can help [Company Name] build innovative AI solutions. Thank you for your consideration."
      ],
      "closing": "Best regards,",
      "signature": "Songhai (Frank) Fan"
    },
    "ux-researcher": {
      "recipient": {
        "company": "[Company Name]",
        "position": "[Position Title]",
        "department": "[UX/Research Team]"
      },
      "opening": "Dear Hiring Team,",
      "body": [
        "I am writing to express my interest in the UX Research position at [Company Name]. As a PhD researcher in Human-Centered Computing with extensive experience in experimental design, usability testing, and mixed-methods research, I am passionate about creating user-centered solutions that bridge technology and human needs.",
        "My research background has provided me with deep expertise in conducting controlled experiments, statistical testing, and translating complex user insights into actionable design recommendations. I have led user studies involving 200+ participants, developed innovative research methodologies for evaluating AI systems, and created frameworks that align algorithmic outputs with human understanding across cognitive tasks.",
        "What draws me to this role is the opportunity to apply rigorous research methodologies in a product development context. My experience in both qualitative and quantitative research methods, combined with my technical background in data analysis and visualization, allows me to provide comprehensive insights that inform both strategic decisions and detailed design implementations.",
        "I would be thrilled to discuss how my research expertise and passion for human-centered design can contribute to creating exceptional user experiences at [Company Name]. Thank you for considering my application."
      ],
      "closing": "Warm regards,",
      "signature": "Songhai (Frank) Fan"
    },
    "data-viz-developer": {
      "recipient": {
        "company": "[Company Name]",
        "position": "[Position Title]",
        "department": "[Development/Design Team]"
      },
      "opening": "Dear Hiring Manager,",
      "body": [
        "I am excited to apply for the Data Visualization Developer position at [Company Name]. With my PhD research in narrative visualization and extensive hands-on experience with D3.js, React, and interactive design, I am passionate about creating compelling visual experiences that make complex data accessible and engaging.",
        "My technical expertise includes building interactive web applications, developing custom scrollytelling frameworks, and creating dynamic dashboards using modern JavaScript technologies. Through projects like causal network visualizations and participatory modeling tools, I have demonstrated my ability to transform complex datasets into intuitive, user-friendly interfaces that drive understanding and decision-making.",
        "What particularly excites me about this opportunity is the chance to combine my research background in human-centered design with practical web development skills. I understand not only how to create beautiful visualizations but also how to ensure they effectively communicate insights and support user goals through thoughtful interaction design and accessibility considerations.",
        "I would love to discuss how my unique combination of visualization research, technical development skills, and user experience expertise can help [Company Name] create impactful data experiences. Thank you for your time and consideration."
      ],
      "closing": "Kind regards,",
      "signature": "Songhai (Frank) Fan"
    },
    "data-engineer": {
      "recipient": {
        "company": "[Company Name]",
        "position": "[Position Title]",
        "department": "[Engineering/Data Team]"
      },
      "opening": "Dear Hiring Manager,",
      "body": [
        "I am writing to express my strong interest in the Data Engineer position at [Company Name]. With my background in building scalable data processing systems and expertise in Python, SQL, Hadoop, and Spark, I am excited about the opportunity to contribute to your data infrastructure and pipeline development.",
        "Through my research and project work, I have gained experience in ETL pipeline development, real-time data processing, and building systems that handle large-scale data operations. My work on narrative visualization projects has required me to design robust data architectures that can efficiently process and transform complex datasets while maintaining data quality and reliability.",
        "What attracts me to this role is the opportunity to apply my technical skills in building the foundational systems that enable data-driven decision making. I understand the importance of creating scalable, maintainable data infrastructure that can grow with business needs while ensuring data accuracy and accessibility for downstream analytics and applications.",
        "I would welcome the chance to discuss how my experience in data processing, system architecture, and analytical thinking can contribute to [Company Name]'s data engineering initiatives. Thank you for considering my application."
      ],
      "closing": "Sincerely,",
      "signature": "Songhai (Frank) Fan"
    }
  }
}
