{
  "config": {
    "default_version": "data-scientist",
    "theme_base": "theme-",
    "available_sections": [
      "summary",
      "work_experience",
      "technical_skills",
      "projects",
      "phd_research",
      "education",
      "publications",
      "certifications"
    ],
    "skill_categories": [
      "artificial_intelligence",
      "data_science",
      "web_technologies",
      "research_skills"
    ]
  },

  "versions": {
    "data-scientist": {
      "display_name": "Data Scientist / Analyst",
      "theme_color": "#1f77b4",
      "icon": "fas fa-chart-line",
      "summary": "Data Scientist with PhD expertise in statistical modeling and data analytics. Expert in Python, R, SQL for comprehensive data analysis and business intelligence. Strong background in feature engineering, A/B testing, and turning complex datasets into actionable insights. Proven track record in building predictive models and data-driven solutions for business decision-making.",

      "content_config": {
        "selected_skills": [
          "data_science_analytics",
          "big_data_engineering",
          "machine_learning_nlp"
        ],
        "sections_order": [
          "summary",
          "technical_skills",
          "projects",
          "phd_research",
          "education",
          "publications",
          "work_experience",
          "certifications"
        ],
        "projects_limit": 3,
        "include_projects": [
          "causal-network-viz",
          "perspectiva-tool",
          "data-storytelling-cases"
        ]
      },

      "content_overrides": {
        "project_descriptions": {
          "causal-network-viz": "Statistical analysis and predictive modeling for causal relationship discovery, utilizing advanced regression techniques and feature engineering.",
          "perspectiva-tool": "Business intelligence dashboard with statistical modeling for policy impact analysis and data-driven decision support.",
          "data-storytelling-cases": "Comprehensive data analysis projects with statistical validation, A/B testing frameworks, and business intelligence reporting."
        }
      }
    },

    "nlp-ai-engineer": {
      "display_name": "NLP / AI Engineer",
      "theme_color": "#ff7f0e",
      "icon": "fas fa-robot",
      "summary": "NLP/AI Engineer with PhD expertise in natural language processing and machine learning. Expert in Python, PyTorch, and advanced NLP techniques including BERT/GPT fine-tuning and prompt engineering. Strong background in developing AI systems for text analysis, language understanding, and generative AI applications. Proven experience in building scalable NLP pipelines and AI-powered solutions.",

      "content_config": {
        "selected_skills": [
          "machine_learning_nlp",
          "data_science_analytics",
          "research_design_evaluation"
        ],
        "sections_order": [
          "summary",
          "phd_research",
          "technical_skills",
          "projects",
          "publications",
          "education",
          "work_experience",
          "certifications"
        ],
        "projects_limit": 3,
        "include_projects": [
          "causal-network-viz",
          "perspectiva-tool",
          "data-storytelling-cases"
        ]
      },

      "content_overrides": {
        "project_descriptions": {
          "causal-network-viz": "NLP-powered system for automated text analysis and relationship extraction using BERT/GPT models and advanced language processing techniques.",
          "perspectiva-tool": "AI-augmented text analysis platform with LLM integration for intelligent content understanding and automated insight generation.",
          "data-storytelling-cases": "Generative AI applications for automated narrative generation and intelligent text analysis, showcasing advanced NLP capabilities."
        }
      }
    },

    "ux-researcher": {
      "display_name": "UX Researcher",
      "theme_color": "#2ca02c",
      "icon": "fas fa-users",
      "summary": "UX Researcher with PhD in Human-Centered Computing, specializing in experimental design and usability testing. Expert in conducting controlled user studies, A/B testing, and mixed-methods research. Strong background in human-computer interaction and translating user insights into actionable design recommendations. Proven experience in improving user experiences through rigorous research methodologies.",

      "content_config": {
        "selected_skills": [
          "web_development_ux",
          "research_design_evaluation",
          "data_science_analytics"
        ],
        "sections_order": [
          "summary",
          "phd_research",
          "technical_skills",
          "publications",
          "projects",
          "education",
          "work_experience",
          "certifications"
        ],
        "projects_limit": 3,
        "include_projects": [
          "causal-network-viz",
          "perspectiva-tool",
          "data-storytelling-cases"
        ]
      },

      "content_overrides": {
        "project_descriptions": {
          "causal-network-viz": "User-centered design research with comprehensive usability testing and human-computer interaction analysis for complex data visualization interfaces.",
          "perspectiva-tool": "Participatory design methodology with extensive user research and stakeholder engagement for collaborative decision-making tools.",
          "data-storytelling-cases": "User experience research for narrative interfaces, focusing on user engagement studies and comprehension analysis across diverse audiences."
        }
      }
    },

    "data-viz-developer": {
      "display_name": "Data Viz Developer",
      "theme_color": "#d62728",
      "icon": "fas fa-chart-bar",
      "summary": "Data Visualization Developer with PhD expertise in interactive data visualization and web development. Expert in JavaScript, React, D3.js for creating compelling interactive dashboards and data stories. Strong background in translating complex datasets into intuitive visual experiences and building scalable visualization solutions. Proven track record in developing innovative data visualization frameworks.",

      "content_config": {
        "selected_skills": [
          "web_development_ux",
          "data_science_analytics",
          "machine_learning_nlp"
        ],
        "sections_order": [
          "summary",
          "technical_skills",
          "projects",
          "phd_research",
          "education",
          "publications",
          "work_experience",
          "certifications"
        ],
        "projects_limit": 4,
        "include_projects": [
          "causal-network-viz",
          "perspectiva-tool",
          "data-storytelling-cases"
        ]
      },

      "content_overrides": {
        "project_descriptions": {
          "causal-network-viz": "Interactive network visualization using D3.js and React for complex causal relationship analysis with advanced interactive features and real-time data processing.",
          "perspectiva-tool": "Complex systems visualization platform with custom dashboard design, interactive data exploration tools, and responsive web interfaces.",
          "data-storytelling-cases": "Comprehensive data visualization projects using scrollytelling, interactive charts, and custom visualization frameworks for narrative-driven insights."
        }
      }
    },

    "analytics-consultant": {
      "display_name": "Analytics Consultant",
      "theme_color": "#9467bd",
      "icon": "fas fa-chart-pie",
      "summary": "Analytics Consultant with PhD expertise in business intelligence and data strategy. Expert in Tableau, Power BI, and client-facing analytics solutions. Strong background in translating complex research into actionable business insights and strategic recommendations. Proven experience in consulting engagements and building data-driven decision-making frameworks for organizations.",

      "content_config": {
        "selected_skills": [
          "data_science_analytics",
          "research_design_evaluation",
          "big_data_engineering"
        ],
        "sections_order": [
          "summary",
          "phd_research",
          "publications",
          "technical_skills",
          "projects",
          "education",
          "work_experience",
          "certifications"
        ],
        "projects_limit": 3,
        "include_projects": [
          "causal-network-viz",
          "perspectiva-tool",
          "data-storytelling-cases"
        ]
      },

      "content_overrides": {
        "project_descriptions": {
          "causal-network-viz": "Strategic consulting project for causal analysis framework development, with client-facing dashboards and executive reporting solutions.",
          "perspectiva-tool": "Organizational consulting engagement for participatory decision-making systems with strategic planning and stakeholder alignment tools.",
          "data-storytelling-cases": "Client consulting projects focused on communication strategy and research translation for policy and organizational impact."
        }
      }
    }
  }
}
