{
  "config": {
    "default_version": "data-scientist",
    "theme_base": "theme-",
    "available_sections": [
      "cover_letter",
      "summary",
      "work_experience",
      "technical_skills",
      "projects",
      "phd_research",
      "education",
      "publications",
      "certifications"
    ],
    "skill_categories": [
      "artificial_intelligence",
      "data_science",
      "web_technologies",
      "research_skills"
    ]
  },

  "versions": {
    "data-scientist": {
      "display_name": "Data Scientist / Analyst",
      "theme_color": "#1D4ED8",
      "icon": "fas fa-chart-line",
      "summary": "PhD Researcher in Human-Centered Computing passionate about data science and analytics for enhanced human-data interaction. Expertise in statistical modeling, data visualization, and A/B testing, with a focus on developing data-driven insights that bridge human understanding with complex datasets. Skilled in Python, R, SQL, and Tableau, combining technical proficiency with a deep interest in evidence-based decision making.",

      "content_config": {
        "include_cover_letter": true,
        "selected_skills": [
          "data_analysis",
          "big_data_engineering",
          "data_science_ai"
        ],
        "sections_order": [
          "summary",
          "technical_skills",
          "projects",
          "phd_research",
          "education",
          "publications",
          "work_experience",
          "certifications"
        ],
        "projects_limit": 3,
        "include_projects": [
          "causal-network-viz",
          "perspectiva-tool",
          "data-storytelling-cases"
        ]
      },

      "content_overrides": {
        "project_descriptions": {
          "causal-network-viz": "Built an interactive web app to visualize sentence-level causal networks using NLP and network analysis, with statistical modeling for relationship discovery.",
          "perspectiva-tool": "Designed a system to document and visualize stakeholder-driven causal models for urban governance, incorporating data-driven policy analysis.",
          "data-storytelling-cases": "Collaborative data visualization projects with research organizations focusing on narrative-driven insights and statistical validation."
        }
      }
    },

    "nlp-ai-engineer": {
      "display_name": "NLP / AI Engineer",
      "theme_color": "#377446",
      "icon": "fas fa-robot",
      "summary": "PhD Researcher in Human-Centered Computing passionate about leveraging LLMs and AI for enhanced human-data interaction. Expertise in natural language processing, machine learning, and text analysis, with a focus on developing AI-augmented frameworks that bridge human understanding with complex language systems. Skilled in Python, PyTorch, and advanced NLP techniques, combining technical proficiency with a deep interest in human-AI collaborative systems.",

      "content_config": {
        "include_cover_letter": true,
        "selected_skills": [
          "data_science_ai",
          "data_analysis",
          "research_evaluation"
        ],
        "sections_order": [
          "summary",
          "phd_research",
          "technical_skills",
          "projects",
          "publications",
          "education",
          "work_experience",
          "certifications"
        ],
        "projects_limit": 3,
        "include_projects": [
          "causal-network-viz",
          "perspectiva-tool",
          "data-storytelling-cases"
        ]
      },

      "content_overrides": {
        "project_descriptions": {
          "causal-network-viz": "Built an interactive web app to visualize sentence-level causal networks using NLP and network analysis, with advanced language processing for relationship extraction.",
          "perspectiva-tool": "Designed a system to document and visualize stakeholder-driven causal models for urban governance, incorporating AI-augmented text analysis.",
          "data-storytelling-cases": "Collaborative data visualization projects with research organizations focusing on narrative-driven insights and intelligent text analysis."
        }
      }
    },

    "ux-researcher": {
      "display_name": "UX Research",
      "theme_color": "#000000",
      "icon": "fas fa-users",
      "summary": "PhD Researcher in Human-Centered Computing passionate about user experience research and human-computer interaction. Expertise in experimental design, usability testing, and mixed-methods research, with a focus on developing user-centered frameworks that bridge human needs with technology systems. Skilled in research methodologies and design thinking, combining academic rigor with a deep interest in creating intuitive human-computer interfaces.",

      "content_config": {
        "include_cover_letter": true,
        "selected_skills": [
          "web_development_ux",
          "research_evaluation",
          "data_analysis"
        ],
        "sections_order": [
          "summary",
          "phd_research",
          "technical_skills",
          "publications",
          "projects",
          "education",
          "work_experience",
          "certifications"
        ],
        "projects_limit": 3,
        "include_projects": [
          "causal-network-viz",
          "perspectiva-tool",
          "data-storytelling-cases"
        ]
      },

      "content_overrides": {
        "project_descriptions": {
          "causal-network-viz": "Built an interactive web app to visualize sentence-level causal networks using NLP and network analysis, with user-centered design research and usability testing.",
          "perspectiva-tool": "Designed a system to document and visualize stakeholder-driven causal models for urban governance, incorporating participatory design methodology.",
          "data-storytelling-cases": "Collaborative data visualization projects with research organizations focusing on narrative-driven insights and user experience research."
        }
      }
    },

    "data-viz-developer": {
      "display_name": "Data Viz Developer",
      "theme_color": "#F97316",
      "icon": "fas fa-chart-bar",
      "summary": "PhD Researcher in Human-Centered Computing passionate about data visualization and web development for enhanced human-data interaction. Expertise in narrative visualization, interactive design, and data storytelling, with a focus on developing visual frameworks that bridge human understanding with complex data systems. Skilled in JavaScript, React, D3.js, and visualization techniques, combining technical proficiency with a deep interest in immersive analytics.",

      "content_config": {
        "include_cover_letter": true,
        "selected_skills": [
          "web_development_ux",
          "data_analysis",
          "data_science_ai"
        ],
        "sections_order": [
          "summary",
          "technical_skills",
          "projects",
          "phd_research",
          "education",
          "publications",
          "work_experience",
          "certifications"
        ],
        "projects_limit": 4,
        "include_projects": [
          "causal-network-viz",
          "perspectiva-tool",
          "data-storytelling-cases"
        ]
      },

      "content_overrides": {
        "project_descriptions": {
          "causal-network-viz": "Built an interactive web app to visualize sentence-level causal networks using D3.js, React, and advanced interactive features for complex relationship analysis.",
          "perspectiva-tool": "Designed a system to document and visualize stakeholder-driven causal models for urban governance, featuring custom dashboard design and interactive data exploration.",
          "data-storytelling-cases": "Collaborative data visualization projects with research organizations focusing on narrative-driven insights using scrollytelling and interactive charts."
        }
      }
    },

    "data-engineer": {
      "display_name": "Data Engineer",
      "theme_color": "#331D38",
      "icon": "fas fa-database",
      "summary": "PhD Researcher in Human-Centered Computing passionate about data engineering and infrastructure for enhanced human-data interaction. Expertise in data pipelines, ETL processes, and big data technologies, with a focus on developing scalable frameworks that bridge human understanding with complex data systems. Skilled in Python, SQL, and data infrastructure tools, combining technical proficiency with a deep interest in real-time data processing and analytics.",

      "content_config": {
        "include_cover_letter": true,
        "selected_skills": [
          "big_data_engineering",
          "data_analysis",
          "data_science_ai"
        ],
        "sections_order": [
          "summary",
          "technical_skills",
          "projects",
          "phd_research",
          "education",
          "publications",
          "work_experience",
          "certifications"
        ],
        "projects_limit": 3,
        "include_projects": [
          "causal-network-viz",
          "perspectiva-tool",
          "data-storytelling-cases"
        ]
      },

      "content_overrides": {
        "project_descriptions": {
          "causal-network-viz": "Built an interactive web app to visualize sentence-level causal networks using NLP and network analysis, with data pipeline development for relationship processing.",
          "perspectiva-tool": "Designed a system to document and visualize stakeholder-driven causal models for urban governance, incorporating scalable data infrastructure and ETL processes.",
          "data-storytelling-cases": "Collaborative data visualization projects with research organizations focusing on narrative-driven insights and large-scale data processing."
        }
      }
    }
  }
}
