{
  "config": {
    "default_version": "data-scientist",
    "theme_base": "theme-",
    "available_sections": [
      "summary",
      "work_experience",
      "technical_skills",
      "projects",
      "phd_research",
      "education",
      "publications",
      "certifications"
    ],
    "skill_categories": [
      "artificial_intelligence",
      "data_science",
      "web_technologies",
      "research_skills"
    ]
  },

  "versions": {
    "data-scientist": {
      "display_name": "Data Scientist / Analyst",
      "theme_color": "#1D4ED8",
      "icon": "fas fa-chart-line",
      "summary": "PhD candidate in Human-Centered Computing with strong data science background. Skilled in Python, R, SQL for data analysis and statistical modeling. Experience in data visualization, A/B testing, and translating research insights into practical applications. Combines academic research with practical data science skills for evidence-based decision making.",

      "content_config": {
        "selected_skills": [
          "data_analysis",
          "big_data_engineering",
          "data_science_ai"
        ],
        "sections_order": [
          "summary",
          "technical_skills",
          "projects",
          "phd_research",
          "education",
          "publications",
          "work_experience",
          "certifications"
        ],
        "projects_limit": 3,
        "include_projects": [
          "causal-network-viz",
          "perspectiva-tool",
          "data-storytelling-cases"
        ]
      },

      "content_overrides": {
        "project_descriptions": {
          "causal-network-viz": "Built an interactive web app to visualize sentence-level causal networks using NLP and network analysis, with statistical modeling for relationship discovery.",
          "perspectiva-tool": "Designed a system to document and visualize stakeholder-driven causal models for urban governance, incorporating data-driven policy analysis.",
          "data-storytelling-cases": "Collaborative data visualization projects with research organizations focusing on narrative-driven insights and statistical validation."
        }
      }
    },

    "nlp-ai-engineer": {
      "display_name": "NLP / AI Engineer",
      "theme_color": "#22C55E",
      "icon": "fas fa-robot",
      "summary": "PhD candidate in Human-Centered Computing with focus on NLP and AI applications. Skilled in Python, PyTorch, and natural language processing techniques. Research experience in text analysis, language modeling, and developing AI-powered visualization systems. Combines theoretical understanding with practical implementation of NLP and machine learning solutions.",

      "content_config": {
        "selected_skills": [
          "data_science_ai",
          "data_analysis",
          "research_evaluation"
        ],
        "sections_order": [
          "summary",
          "phd_research",
          "technical_skills",
          "projects",
          "publications",
          "education",
          "work_experience",
          "certifications"
        ],
        "projects_limit": 3,
        "include_projects": [
          "causal-network-viz",
          "perspectiva-tool",
          "data-storytelling-cases"
        ]
      },

      "content_overrides": {
        "project_descriptions": {
          "causal-network-viz": "Built an interactive web app to visualize sentence-level causal networks using NLP and network analysis, with advanced language processing for relationship extraction.",
          "perspectiva-tool": "Designed a system to document and visualize stakeholder-driven causal models for urban governance, incorporating AI-augmented text analysis.",
          "data-storytelling-cases": "Collaborative data visualization projects with research organizations focusing on narrative-driven insights and intelligent text analysis."
        }
      }
    },

    "ux-researcher": {
      "display_name": "UX Research",
      "theme_color": "#000000",
      "icon": "fas fa-users",
      "summary": "PhD candidate in Human-Centered Computing specializing in UX research and human-computer interaction. Experience in experimental design, usability testing, and mixed-methods research. Strong background in user-centered design and translating research insights into practical design recommendations. Combines academic rigor with practical UX research methodologies.",

      "content_config": {
        "selected_skills": [
          "web_development_ux",
          "research_evaluation",
          "data_analysis"
        ],
        "sections_order": [
          "summary",
          "phd_research",
          "technical_skills",
          "publications",
          "projects",
          "education",
          "work_experience",
          "certifications"
        ],
        "projects_limit": 3,
        "include_projects": [
          "causal-network-viz",
          "perspectiva-tool",
          "data-storytelling-cases"
        ]
      },

      "content_overrides": {
        "project_descriptions": {
          "causal-network-viz": "Built an interactive web app to visualize sentence-level causal networks using NLP and network analysis, with user-centered design research and usability testing.",
          "perspectiva-tool": "Designed a system to document and visualize stakeholder-driven causal models for urban governance, incorporating participatory design methodology.",
          "data-storytelling-cases": "Collaborative data visualization projects with research organizations focusing on narrative-driven insights and user experience research."
        }
      }
    },

    "data-viz-developer": {
      "display_name": "Data Viz Developer",
      "theme_color": "#F97316",
      "icon": "fas fa-chart-bar",
      "summary": "PhD candidate in Human-Centered Computing with focus on data visualization and web development. Skilled in JavaScript, React, D3.js for creating interactive data visualizations and web applications. Research experience in narrative visualization and translating complex datasets into intuitive visual experiences. Combines academic research with practical web development and visualization skills.",

      "content_config": {
        "selected_skills": [
          "web_development_ux",
          "data_analysis",
          "data_science_ai"
        ],
        "sections_order": [
          "summary",
          "technical_skills",
          "projects",
          "phd_research",
          "education",
          "publications",
          "work_experience",
          "certifications"
        ],
        "projects_limit": 4,
        "include_projects": [
          "causal-network-viz",
          "perspectiva-tool",
          "data-storytelling-cases"
        ]
      },

      "content_overrides": {
        "project_descriptions": {
          "causal-network-viz": "Built an interactive web app to visualize sentence-level causal networks using D3.js, React, and advanced interactive features for complex relationship analysis.",
          "perspectiva-tool": "Designed a system to document and visualize stakeholder-driven causal models for urban governance, featuring custom dashboard design and interactive data exploration.",
          "data-storytelling-cases": "Collaborative data visualization projects with research organizations focusing on narrative-driven insights using scrollytelling and interactive charts."
        }
      }
    },

    "data-engineer": {
      "display_name": "Data Engineer",
      "theme_color": "#331D38",
      "icon": "fas fa-database",
      "summary": "PhD candidate in Human-Centered Computing with data engineering background. Skilled in building data pipelines, ETL processes, and data infrastructure. Experience with big data technologies and real-time data processing for research applications. Combines academic research with practical data engineering skills for scalable data solutions.",

      "content_config": {
        "selected_skills": [
          "big_data_engineering",
          "data_analysis",
          "data_science_ai"
        ],
        "sections_order": [
          "summary",
          "technical_skills",
          "projects",
          "phd_research",
          "education",
          "publications",
          "work_experience",
          "certifications"
        ],
        "projects_limit": 3,
        "include_projects": [
          "causal-network-viz",
          "perspectiva-tool",
          "data-storytelling-cases"
        ]
      },

      "content_overrides": {
        "project_descriptions": {
          "causal-network-viz": "Built an interactive web app to visualize sentence-level causal networks using NLP and network analysis, with data pipeline development for relationship processing.",
          "perspectiva-tool": "Designed a system to document and visualize stakeholder-driven causal models for urban governance, incorporating scalable data infrastructure and ETL processes.",
          "data-storytelling-cases": "Collaborative data visualization projects with research organizations focusing on narrative-driven insights and large-scale data processing."
        }
      }
    }
  }
}
